In [3]:
import pandas as pd
import numpy as np
string_data=pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0]=None

In [8]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [9]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [10]:
from numpy import nan as NA

In [11]:
data=pd.Series([1,NA,3.5,NA,7])

In [12]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [13]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data=pd.DataFrame([[1.,6.5,3.],[1,NA,NA],
                  [NA,NA,NA],[NA,6.5,3.]])

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned=data.dropna()

In [18]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [19]:
data.dropna(how='all') #jis main saray NA hungy wo drop hojaeyga

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [20]:
data[4]=NA #add new column(4) and fill with values NA

In [21]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [22]:
data.dropna(axis=1,how='all') #delete column with all values NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
df=pd.DataFrame(np.random.randn(7,3))

In [24]:
df

          0         1         2
0 -0.885786  1.203109  0.237998
1 -0.296927  0.194048  0.598805
2  1.715905 -0.167090 -0.491297
3  0.866072  0.570824 -0.780358
4  1.230880 -0.348040 -0.006119
5 -0.565130  0.497688 -1.514067
6 -0.220724 -0.531927 -0.866940

In [25]:
df.iloc[:4,1]

0    1.203109
1    0.194048
2   -0.167090
3    0.570824
Name: 1, dtype: float64

In [26]:
df.iloc[:4,1]=NA

In [28]:
df

          0         1         2
0 -0.885786       NaN  0.237998
1 -0.296927       NaN  0.598805
2  1.715905       NaN -0.491297
3  0.866072       NaN -0.780358
4  1.230880 -0.348040 -0.006119
5 -0.565130  0.497688 -1.514067
6 -0.220724 -0.531927 -0.866940

In [29]:
df.iloc[:2,2]

0    0.237998
1    0.598805
Name: 2, dtype: float64

In [30]:
df.iloc[:2,2]=NA

In [31]:
df

          0         1         2
0 -0.885786       NaN       NaN
1 -0.296927       NaN       NaN
2  1.715905       NaN -0.491297
3  0.866072       NaN -0.780358
4  1.230880 -0.348040 -0.006119
5 -0.565130  0.497688 -1.514067
6 -0.220724 -0.531927 -0.866940

In [32]:
df.dropna()

          0         1         2
4  1.230880 -0.348040 -0.006119
5 -0.565130  0.497688 -1.514067
6 -0.220724 -0.531927 -0.866940

In [34]:
df

          0         1         2
0 -0.885786       NaN       NaN
1 -0.296927       NaN       NaN
2  1.715905       NaN -0.491297
3  0.866072       NaN -0.780358
4  1.230880 -0.348040 -0.006119
5 -0.565130  0.497688 -1.514067
6 -0.220724 -0.531927 -0.866940

In [37]:
df.dropna(thresh=2) #Keep only the rows with at least 2 non-NA values.

          0         1         2
2  1.715905       NaN -0.491297
3  0.866072       NaN -0.780358
4  1.230880 -0.348040 -0.006119
5 -0.565130  0.497688 -1.514067
6 -0.220724 -0.531927 -0.866940

In [38]:
df.fillna(0)

          0         1         2
0 -0.885786  0.000000  0.000000
1 -0.296927  0.000000  0.000000
2  1.715905  0.000000 -0.491297
3  0.866072  0.000000 -0.780358
4  1.230880 -0.348040 -0.006119
5 -0.565130  0.497688 -1.514067
6 -0.220724 -0.531927 -0.866940

In [39]:
df.fillna({1:0.5, 2:0})

          0         1         2
0 -0.885786  0.500000  0.000000
1 -0.296927  0.500000  0.000000
2  1.715905  0.500000 -0.491297
3  0.866072  0.500000 -0.780358
4  1.230880 -0.348040 -0.006119
5 -0.565130  0.497688 -1.514067
6 -0.220724 -0.531927 -0.866940

In [40]:
df.fillna(0, inplace=True)

In [41]:
df

          0         1         2
0 -0.885786  0.000000  0.000000
1 -0.296927  0.000000  0.000000
2  1.715905  0.000000 -0.491297
3  0.866072  0.000000 -0.780358
4  1.230880 -0.348040 -0.006119
5 -0.565130  0.497688 -1.514067
6 -0.220724 -0.531927 -0.866940

In [49]:
df=pd.DataFrame(np.random.randn(6,3))

In [50]:
df

          0         1         2
0 -1.240162  0.581261 -0.788743
1 -1.000904  0.086362  0.627824
2  0.872753 -0.745555  0.005658
3 -0.902074 -1.155101 -1.491742
4  0.640206  1.085346 -1.628588
5 -0.882294 -1.229154  0.406764

In [53]:
df.iloc[4:,2]

4   -1.628588
5    0.406764
Name: 2, dtype: float64

In [54]:
df.iloc[4:,2]=NA

In [55]:
df

          0         1         2
0 -1.240162  0.581261 -0.788743
1 -1.000904  0.086362  0.627824
2  0.872753 -0.745555  0.005658
3 -0.902074 -1.155101 -1.491742
4  0.640206  1.085346       NaN
5 -0.882294 -1.229154       NaN

In [56]:
df.fillna(method='ffill')

          0         1         2
0 -1.240162  0.581261 -0.788743
1 -1.000904  0.086362  0.627824
2  0.872753 -0.745555  0.005658
3 -0.902074 -1.155101 -1.491742
4  0.640206  1.085346 -1.491742
5 -0.882294 -1.229154 -1.491742

In [57]:
df.fillna(method='ffill',limit=2) #onlyfill forward 2 NA

          0         1         2
0 -1.240162  0.581261 -0.788743
1 -1.000904  0.086362  0.627824
2  0.872753 -0.745555  0.005658
3 -0.902074 -1.155101 -1.491742
4  0.640206  1.085346 -1.491742
5 -0.882294 -1.229154 -1.491742

In [58]:
data=pd.Series([1.,NA,3.5,NA,7])

In [59]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [60]:
data.mean()

3.8333333333333335

In [61]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [63]:
data=pd.DataFrame({'k1':['one','two']*3+['two'],
                  'k2':[1,1,2,3,3,4,4]})

In [64]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [65]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [66]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [67]:
data['v1']=range(7) #add column with values 0 to 6.

In [68]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [69]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [70]:
data.drop_duplicates(['k1','k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [71]:
data.drop_duplicates(['k1','k2'], keep='last')
#last wala rahayga us sy opr wala drop hojaey ga 
#for eg 6 row rahaygi 5 delete hojaeygi.

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [72]:
data=pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','Pastrami','honey ham','nova lox'],
                  'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [73]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     Pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [75]:
meat_to_animal={
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [76]:
lowercased=data['food']

In [77]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       Pastrami
4    corned beef
5          Bacon
6       Pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [78]:
lowercased=data['food'].str.lower()

In [79]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [80]:
data['animal']=lowercased.map(meat_to_animal)
#animal ka column banaya and meat_to_animal ki jo values lowercased variable main pari thi usko animal k column main daal diaa.

In [81]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     Pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [82]:
data['food']

0          bacon
1    pulled pork
2          bacon
3       Pastrami
4    corned beef
5          Bacon
6       Pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [83]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [90]:
data=pd.Series([1.,-999.,2.,-999.,-1000.,3.])

In [91]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [92]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [93]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [94]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [95]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [4]:
import pandas as pd
import numpy as np
data=pd.DataFrame(np.arange(12).reshape((3,4)),index=['Ohio','Colorado','New York'], columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [8]:
data[:4]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [100]:
transform=lambda x: x[:4].upper()

In [101]:
transform

In [103]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [104]:
data.index=data.index.map(transform)

In [105]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [107]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [109]:
data.rename(index={'OHIO':'INDIANA'},
           columns={'three':'peekabo'})

         one  two  peekabo  four
INDIANA    0    1        2     3
COLO       4    5        6     7
NEW        8    9       10    11

In [110]:
data.rename(index={'OHIO':'INDIANA'},
           inplace=True)

In [111]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [112]:
ages=[20,22,25,27,21,23,37,61,45,41,32]

In [113]:
ages

[20, 22, 25, 27, 21, 23, 37, 61, 45, 41, 32]

In [114]:
bins=[18,25,35,60,100]

In [115]:
bins

[18, 25, 35, 60, 100]

In [119]:
cats=pd.cut(ages,bins)
#cut could convert ages to groups of age ranges

In [117]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (35, 60], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 11
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [122]:
cats.codes #indexes

array([0, 0, 0, 1, 0, 0, 2, 3, 2, 2, 1], dtype=int8)

In [123]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [124]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     2
(60, 100]    1
dtype: int64

In [125]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [36, 61), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 11
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [126]:
group_names=['Youth','YoungAdult','MiddleAged','Senior']

In [127]:
group_names

['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [128]:
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., MiddleAged, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 11
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [129]:
data=np.random.randn(20)

In [130]:
data

array([-0.63093139, -0.37236186, -0.52800112, -0.25080823, -2.34066714,
       -0.70468827, -0.52341295, -0.18765939, -0.93324856,  0.67769161,
       -0.14334867,  0.43486053,  1.24101485,  0.37745273, -2.32561067,
        0.62724362,  1.45930605, -1.15095785,  0.10608927, -0.56047136])

In [132]:
pd.cut(data,4,precision=2)
#Defines the number of equal-width bins in the range of x
#page no 216

[(-1.39, -0.44], (-0.44, 0.51], (-1.39, -0.44], (-0.44, 0.51], (-2.34, -1.39], ..., (0.51, 1.46], (0.51, 1.46], (-1.39, -0.44], (-0.44, 0.51], (-1.39, -0.44]]
Length: 20
Categories (4, interval[float64]): [(-2.34, -1.39] < (-1.39, -0.44] < (-0.44, 0.51] < (0.51, 1.46]]

In [133]:
data=np.random.randn(1000)

In [139]:
data

array([ 1.43119630e-01,  5.24031242e-01, -8.14578502e-03, -7.75034007e-01,
        6.50930335e-01,  1.19066931e+00,  2.15280488e-02,  6.26835668e-02,
       -3.71046143e-01,  1.30952012e-01,  1.95425894e-01, -8.46074672e-01,
        2.33294131e-01,  1.22107802e+00,  6.32323853e-01, -1.79622934e+00,
        8.19490438e-01,  6.15922187e-01, -2.10815996e+00,  5.07418035e-01,
        2.09113750e+00, -2.79716805e-01,  4.97437261e-02, -5.38677461e-02,
       -1.61279751e+00, -3.10698271e-01,  4.35606442e-01, -8.33140353e-01,
       -5.80932052e-02, -3.27154716e-01, -5.54710817e-01,  1.68544326e+00,
       -1.90233322e-01,  1.31140242e+00,  9.34928313e-01,  1.74588790e+00,
        1.14663668e+00,  1.11498486e+00,  1.51169361e+00,  4.37705432e-01,
       -1.58025884e+00, -1.68322005e+00, -1.67634111e-01, -5.47125245e-01,
       -9.67703400e-01,  2.86389644e-01, -9.50051729e-01,  4.58848674e-01,
        4.36044010e-01, -7.66449418e-01, -1.25169972e+00, -1.07834841e+00,
        9.37955819e-01, -2.74518162e-01,  2.08571139e-01, -5.47087163e-01,
        3.14842183e-01,  1.63189519e+00,  2.69344584e+00, -1.30174575e+00,
       -7.72148133e-01, -2.44840882e-01,  1.13623732e+00, -5.67371623e-01,
       -5.05350152e-01, -9.29059400e-02, -2.23526321e-01, -1.08673209e+00,
        2.40004975e-01, -1.16679739e+00,  3.14369350e-01,  2.59282773e-01,
        1.53737597e+00, -2.81245182e-01,  1.12027422e+00,  2.00823413e+00,
        1.15033302e+00,  4.44427096e-01, -2.00949803e+00, -1.17586333e+00,
       -5.66002080e-01,  5.60148345e-01, -3.87923915e-01,  1.82043517e+00,
        3.80013029e-02, -1.23444558e+00, -2.12854742e-01, -6.30907647e-01,
       -1.51100560e+00, -6.78763789e-02,  2.00151441e+00, -1.83335507e+00,
        4.54466144e-01,  1.10667515e+00,  6.15138846e-01, -2.61814576e-01,
       -8.28300815e-01,  1.01236487e+00, -6.26225109e-01,  3.47057229e-01,
       -4.06680404e-01, -6.37567860e-02,  1.55751982e+00, -8.43335510e-01,
       -8.71431582e-01,  1.12941471e+00, -8.73379594e-02, -1.87432405e-01,
        1.03975068e+00, -3.44264423e-01, -2.25663936e-01, -1.02845629e+00,
        5.73616440e-01, -4.02152781e-01, -8.21970257e-01,  1.69306801e+00,
        1.20193434e+00, -4.83958532e-02,  2.23999293e+00,  1.76801151e-01,
        5.36055991e-01, -1.82395172e-01, -4.50135884e-01,  3.61477735e-01,
       -1.12048734e-01, -1.13566625e+00, -9.86306205e-01, -1.62474607e-01,
        1.65062052e+00, -2.98014209e-01,  1.30661133e+00, -1.71616915e+00,
       -1.39042680e+00,  1.40032147e+00,  9.10629997e-01, -5.95600927e-01,
       -2.45865656e+00,  9.50442246e-01,  1.42694349e+00,  1.77287078e+00,
        1.10598353e+00, -4.69007190e-01, -2.70723238e-01,  2.58037741e+00,
       -1.18881218e+00, -8.03353848e-02, -4.89632358e-01, -4.46427245e-01,
       -1.71361145e-01,  2.25755933e+00, -1.44768901e+00, -1.03123591e+00,
       -1.01475095e-02, -3.38293411e-01,  5.74136604e-02,  1.97521148e+00,
       -2.14604991e-01, -6.21829276e-01, -7.02412186e-01, -1.36932285e+00,
        2.11475772e-01, -4.09982165e-01,  1.40927631e-01, -1.30600713e+00,
        9.36860040e-01, -6.46252566e-01, -1.09880329e+00, -9.34461605e-01,
       -1.07559535e+00, -9.36377404e-01,  2.82164753e-01, -4.97742400e-01,
        3.88107991e-01,  3.65677973e-01, -2.66148404e-01,  9.12703929e-01,
       -3.19230813e-01,  1.73436509e+00,  5.43351208e-01, -8.31295852e-04,
       -1.86529030e-02,  5.53587185e-01, -2.17316382e-01,  1.03915844e+00,
       -6.60879986e-02,  6.09021056e-01, -8.53312517e-01, -6.63639105e-01,
        3.09723233e-01,  6.70401677e-01,  9.71422763e-02, -1.28377290e+00,
        1.16721380e+00,  2.30968796e-01,  1.13315263e+00,  1.00238167e+00,
       -6.25743315e-01,  5.20733531e-02,  1.97590031e-03, -2.04908174e+00,
        1.34558786e+00, -1.70834070e+00, -2.20864371e-01, -1.52798505e-01,
       -2.12893368e-01,  6.60551084e-01, -6.48909727e-01, -2.74356809e-01,
        1.20469623e+00,  6.98099914e-01,  6.54440970e-02,  1.21933258e-01,
        2.44499807e+00, -7.20521610e-01,  9.82274058e-01,  1.01640588e+00,
        1.28280697e+00, -1.07200146e+00, -1.43188764e-01, -2.19284239e+00,
        9.74780869e-01,  4.26156025e-01,  2.63195235e+00, -3.97548206e-01,
       -1.96875330e+00,  3.82649390e-01,  1.11961749e+00, -1.48755172e+00,
        1.06759544e+00,  1.19033543e+00, -1.20293024e+00,  2.50145423e-01,
       -1.17380223e+00,  1.99784147e+00,  1.76206034e-01,  1.72388592e+00,
       -1.60969226e-01, -6.19623593e-01,  1.36223632e+00,  8.54637129e-01,
        1.67761281e-01,  2.00865613e+00,  6.01321006e-01, -1.04344361e+00,
       -6.68194307e-01, -1.03382511e-01, -1.21711213e-01, -1.00139321e+00,
        3.87667376e-01,  1.29147188e-02,  1.73357497e+00,  8.16638716e-01,
       -4.40468802e-01,  1.76953988e+00, -5.99849635e-01, -7.75222481e-01,
       -3.76670506e-01, -9.26664998e-01,  1.80565121e-01,  1.86268053e-01,
       -9.00579079e-01, -2.12875381e+00, -1.31263063e+00, -7.20066590e-01,
        1.97639249e-01,  2.32680660e-01, -1.68575997e+00, -9.12461530e-01,
       -1.94098782e-01, -4.65897622e-01, -1.46867663e+00, -3.96360777e-01,
        9.56500342e-02, -1.21677839e+00, -9.76363761e-01,  3.04748170e-01,
       -9.15882737e-01, -7.21319401e-02,  6.88086202e-01,  7.03664714e-02,
        6.17895643e-01, -1.62607860e+00, -7.71420947e-01, -6.04716180e-01,
       -4.03509829e-02, -2.35077998e-01,  1.20411185e-01,  1.96977246e-01,
        1.45949776e+00,  1.03993955e+00,  1.47154726e+00,  2.43509271e-01,
       -8.09783884e-01, -1.47067437e-01, -1.14514854e+00, -6.83890179e-01,
        1.03714123e+00,  2.31848280e-01,  2.38150962e-01, -6.25871628e-01,
       -1.76615142e+00, -2.00313560e-02,  7.96626087e-01, -1.36053546e+00,
        4.26431864e-01,  1.23539131e+00, -2.34685333e-01, -1.22167807e-01,
        3.48969201e-01,  3.56973577e-01,  1.85144123e+00, -2.44530383e-01,
       -2.83268303e-01, -1.63434010e+00,  4.99903407e-01, -3.81217478e-01,
       -7.65206091e-01,  5.26859677e-01,  2.43692396e-01,  7.99145388e-01,
       -1.10941845e+00, -6.95071089e-01,  1.60970573e-01, -1.74912340e+00,
        1.47330109e+00,  4.04963784e-02, -2.20553263e-01, -8.46048044e-02,
       -3.77332961e-01, -5.78352736e-01, -4.59987316e-01,  1.57318473e-01,
       -9.56124253e-01,  7.94062829e-01, -9.39251204e-01, -1.27682558e+00,
        1.75330317e-01,  1.10735750e-01,  8.38084144e-01, -7.02134598e-01,
        1.02989899e+00, -2.10833339e+00,  7.64650522e-01, -7.88077227e-01,
       -1.07442316e-01, -3.61276338e-01, -1.10750288e-01,  3.90261463e-01,
        3.66702861e-02,  1.01646237e+00,  3.99755537e-01, -1.21539234e+00,
       -1.02973506e+00,  1.67198499e+00, -1.96014089e-01,  2.06537401e+00,
        2.30630050e+00, -9.33436791e-02, -2.36597550e+00, -9.02892707e-01,
       -1.96595100e+00,  4.42976934e-01,  9.58579274e-01, -5.10638667e-01,
       -8.31314042e-01, -8.82662945e-02,  2.49767215e-02, -1.35389616e+00,
       -2.80691010e+00,  5.61235522e-01, -1.03052486e-01, -6.41513820e-01,
       -9.72222719e-01, -1.10132354e+00,  9.45224769e-01, -8.24214506e-01,
        1.27390503e+00,  6.05177802e-01, -7.64030092e-01, -1.34175877e+00,
        1.07307747e+00, -1.62369928e+00,  1.11142490e+00, -1.58468461e-01,
        1.32454828e-01, -1.11984570e+00,  7.08506854e-01, -1.62166080e+00,
        5.11948469e-01,  6.02257075e-01, -1.17815908e+00, -2.45915257e-01,
       -6.58937950e-01,  2.74946361e-02, -2.05363961e-01,  1.17627223e+00,
        5.65749694e-01,  4.17384223e-01,  1.01412040e+00,  2.30769160e+00,
       -5.65077522e-02, -7.20239349e-02,  1.43988976e+00,  1.24852269e+00,
       -9.61344199e-01,  9.39455271e-03,  4.99749255e-01, -7.03000350e-01,
       -1.15730662e+00,  8.63686779e-01,  9.63019649e-01,  1.34996291e-01,
       -9.78458457e-01,  1.51802997e+00, -7.80471485e-01,  9.69091484e-01,
        8.48249207e-02,  1.18829856e+00, -3.06753978e-01,  4.36364292e-01,
        7.26936909e-01, -2.44203457e-01, -1.37793480e-01, -2.04464327e+00,
        1.28285499e+00,  3.48979479e-01, -2.04936291e+00, -5.32180699e-01,
       -1.59059711e+00,  6.40756589e-01, -1.31270519e+00, -1.77365456e-01,
       -1.09446664e-01,  5.52665083e-01,  2.06598536e+00,  4.27675727e-01,
       -1.76954213e-01,  5.04344448e-01, -1.08775006e+00, -2.11079833e+00,
       -1.52646617e+00, -1.16176688e+00,  1.90193415e+00, -1.16542063e+00,
        3.58429680e-01,  3.58077817e-03, -1.60179054e+00,  3.38268080e-01,
        3.66029030e-01,  1.34144733e+00, -1.17451162e+00,  8.67918378e-01,
       -9.98568164e-04,  9.99376592e-01, -1.31483670e+00, -9.52143900e-01,
        1.69541679e-02, -7.93297134e-01,  8.99153912e-01, -2.02705715e+00,
       -1.52762178e+00,  1.21779575e+00,  1.86311070e+00,  8.33098082e-02,
        3.57374883e-01, -2.75120462e-01,  1.79014281e-01, -2.23529189e-01,
        9.17220455e-01,  1.41700042e+00, -8.26349709e-01, -2.90602290e-01,
        8.34445937e-02,  6.74618046e-01, -1.39429972e+00,  6.65558104e-01,
       -1.34120150e+00, -8.41347042e-01,  1.48303550e+00, -9.31326186e-01,
       -4.55823968e-01,  6.92916713e-01, -1.21638824e+00, -1.62874786e+00,
       -8.38919024e-02, -5.21534460e-01,  1.15638130e+00, -1.41871670e+00,
        1.66763288e-01, -1.29530201e+00,  1.07858588e+00,  1.83394537e-01,
        3.50457212e-01, -7.38296301e-01, -4.31630158e-01, -3.56448076e-01,
        3.49707048e-02, -1.93395827e-01,  2.50303802e-01, -1.14251705e+00,
       -1.13871292e+00,  1.28745201e+00, -5.31517447e-01,  1.13387574e-01,
       -3.84036687e-01,  2.38025771e+00, -1.66432911e+00,  1.01523513e-01,
        1.98981428e+00, -2.79690791e-01, -2.01267983e-01,  1.29266580e+00,
        7.99621410e-01,  9.51669379e-01,  1.57007261e-01, -4.20622814e-01,
       -1.84404489e-02, -1.28303549e+00, -9.52594971e-01, -8.39888882e-01,
       -6.37025188e-01,  6.15455836e-01,  1.60780111e+00,  9.11083612e-01,
       -9.17205125e-01, -1.39315684e-02,  2.05512442e+00,  6.39142929e-01,
        6.07790409e-01,  1.70706234e+00,  1.88088316e+00,  1.73351401e+00,
        1.03886401e+00, -1.40030338e+00,  1.45117630e-01, -1.13518822e+00,
       -8.96322957e-01, -1.43529236e+00,  9.34074785e-02, -1.05641661e+00,
        3.66785591e-01,  7.55050341e-01,  2.21649942e-01, -7.60075560e-01,
       -3.89812355e-01,  2.31047198e-01,  9.72464741e-01, -1.74013856e+00,
        8.69809935e-01,  3.36696848e+00, -1.42702651e-01, -1.07234663e-01,
       -3.72569687e-01, -1.33012393e-02,  1.19713404e+00,  2.82380047e-01,
        1.24266576e-01,  1.65969981e+00, -1.24792227e-01,  4.13547150e-01,
       -5.43240178e-01,  1.73687937e-01,  1.84932659e+00,  1.40646067e+00,
       -1.73205636e-01,  3.28415158e-01, -6.63366255e-01,  7.99011724e-01,
       -9.57456870e-02, -8.01260267e-01,  1.62845155e+00, -2.52141367e-01,
       -1.07268774e+00,  1.09001066e+00,  1.30673972e-01, -4.57310595e-01,
       -1.08338144e-01,  5.03692266e-01, -1.98164806e-01,  9.78793309e-02,
       -3.07763191e-01, -4.45053276e-01, -7.71275795e-01, -1.55514782e+00,
        1.43734053e+00,  2.52604694e+00,  7.55254520e-01,  1.20515212e+00,
       -6.95167769e-01,  8.85944842e-02,  1.25482773e+00,  5.09528068e-01,
       -1.29539258e+00, -6.23369196e-01,  7.69705889e-01, -4.98863442e-01,
       -1.45575797e+00,  1.93130492e-01,  4.88630163e-01,  2.63094025e-01,
        7.14318328e-01, -1.50095864e+00,  3.01927179e-01, -1.75607483e+00,
       -1.63600727e+00,  7.45366235e-01, -1.94759740e+00, -5.67834932e-01,
        3.65261266e-01,  1.01521682e-01,  4.61932956e-01,  6.31576705e-01,
       -2.15496316e+00, -1.34491720e+00, -1.52238964e-01,  4.50234604e-01,
        8.83689726e-01, -7.61631609e-01, -1.20219230e+00,  5.42933729e-01,
       -2.55018700e+00, -1.35997932e-01, -1.19894286e+00,  2.14453368e-01,
       -1.02503279e+00, -8.33795539e-02,  2.03442194e-01, -5.62746114e-01,
       -9.97396602e-01,  6.08549055e-01,  9.11572567e-01,  1.01453074e+00,
       -7.51475500e-01,  4.73917651e-01, -9.55536113e-01,  1.11208372e+00,
       -7.24904944e-01,  6.74866679e-01,  1.20648828e+00,  2.24281494e+00,
       -3.42431339e-01,  6.78147668e-01,  9.18910740e-01, -9.12011356e-01,
       -1.75381392e+00, -4.01887732e-01,  1.27073942e-01,  1.68016278e-01,
        7.58342797e-01,  9.53231451e-01, -5.49371045e-01,  8.76753558e-01,
       -1.50681697e-01,  1.06719241e+00, -2.04842281e+00, -3.01318067e-01,
        8.86256218e-02,  1.24279382e+00, -1.24767689e-01,  9.81737191e-02,
       -2.59169357e-01, -4.02232107e-01, -9.92885366e-01, -1.45342035e-01,
        1.20127119e+00,  4.65576638e-01,  3.94958053e-01,  1.91021687e-01,
       -7.57384793e-01, -3.17229683e+00,  3.21162410e-01,  2.62135860e-03,
        4.76373636e-01, -2.56643496e-01,  1.37911732e+00, -1.42942029e+00,
        4.79160518e-02, -2.94134116e-02,  2.47858061e-01, -1.45509827e+00,
        9.04489207e-01,  1.13244864e+00,  1.07272436e+00,  1.43542374e+00,
        9.82903082e-01,  6.73400837e-01, -9.76329446e-02, -1.18248036e+00,
       -1.15506180e+00,  1.04920564e+00, -2.63921651e-01,  9.44175432e-01,
       -8.51983906e-01, -2.02728516e-01,  1.76557926e+00,  1.86165395e+00,
        7.61286872e-01,  7.02021775e-01,  1.41823001e+00,  1.82910368e+00,
       -6.84778661e-01, -4.01913066e-01, -6.41690421e-01,  4.29249535e-02,
        2.67024276e-02, -7.42165498e-01,  1.36104259e-01,  3.30094599e-01,
       -5.27835995e-01, -5.18793641e-01, -1.69413396e+00, -1.81290564e-01,
       -8.62682818e-02, -2.39689630e-01, -1.22533524e+00, -7.61396609e-01,
       -1.68591631e+00,  1.00166270e+00,  7.90857689e-01,  1.34951276e+00,
       -3.45426190e-02,  2.24391475e-01, -5.88967115e-01,  3.10045499e-01,
       -8.66368691e-01,  4.23119636e-01, -2.00182337e-01, -2.80460048e-02,
       -8.40266157e-01,  4.02765186e-01,  5.10056318e-01,  3.34568827e-02,
        1.16701252e+00,  2.14233849e-01,  1.60638969e+00,  1.95516406e-02,
        1.04292971e+00, -2.15308966e+00,  1.23174741e+00, -4.22021925e-01,
        7.60984244e-01, -2.82658807e+00,  2.42281319e+00,  1.08604692e+00,
        1.87585145e+00, -1.73960922e+00, -1.20094276e+00, -5.36949766e-01,
       -6.52851487e-01,  1.12926990e+00, -6.74604304e-01,  2.38098709e-01,
        4.77501334e-01, -2.71414931e-01,  1.73870889e-01, -1.09784774e-01,
        1.02503070e+00,  7.07417120e-01, -9.66254423e-01,  4.33044823e-01,
        4.20292669e-01,  3.26072849e-01, -2.19801340e+00,  1.12061051e+00,
       -1.12418506e+00,  2.39413442e-01, -1.25159418e+00,  1.42796520e-01,
        6.41265993e-01,  1.22520535e+00, -2.38719358e-01,  7.65090792e-01,
       -4.55315316e-02, -7.42787161e-01, -1.50843424e-01, -7.47502724e-01,
        3.59570739e+00,  6.72166165e-01, -1.16821455e+00,  1.79417876e-01,
       -2.67802309e-01,  5.11706568e-01,  1.29180582e+00, -1.04484664e+00,
        9.23649574e-01,  7.98173603e-01,  5.39436358e-01,  5.81433075e-01,
       -6.50760581e-01, -5.48847994e-01, -1.81667882e-01,  7.49868414e-01,
        1.69764645e+00, -2.29605053e-01,  4.60211249e-02, -5.99887431e-01,
       -8.57994290e-01,  1.54965259e+00,  1.29022856e+00, -1.67076346e+00,
        3.82542537e-01,  4.21610837e-01, -2.59968796e-01, -2.37148466e+00,
        1.64336029e+00,  9.39434741e-01, -8.98908335e-01,  5.36956329e-01,
       -2.03102710e+00, -4.90920330e-01, -5.50710239e-01, -4.46253784e-01,
       -6.35734269e-01, -5.77131329e-01,  2.48677829e-01, -1.06841219e+00,
       -6.42190654e-01, -1.65542692e-01,  9.89392604e-01,  3.39458479e-01,
       -1.60334081e+00,  1.21187069e+00,  3.27806971e-01,  1.21251404e+00,
       -2.98412687e-01,  1.72882226e+00, -4.37918947e-01,  2.06010725e-01,
       -6.14787712e-01, -2.12985170e+00,  1.85634552e+00,  5.76122179e-01,
       -8.73221161e-01, -1.69303700e+00, -4.04271024e-01, -1.81797446e+00,
        4.29347977e-01,  5.62539769e-01, -5.56380249e-01, -4.75525439e-01,
       -4.64820789e-01, -1.71602509e+00,  3.65535317e-01, -1.32833692e+00,
       -7.85474848e-01, -6.90995958e-01,  1.34239415e+00,  8.64347568e-02,
       -2.68277698e-01,  5.79116979e-01, -4.61200694e-01, -1.06204600e-01,
        2.04001013e-01,  7.58430354e-01,  4.66732885e-01, -5.43188593e-01,
       -2.44980755e-03, -1.05683224e-01,  2.57219357e+00, -2.18430825e+00,
        1.02457951e+00, -6.53404672e-01,  1.96920192e-01,  2.23957122e-01,
       -4.11430552e-01, -7.99728838e-01, -1.32630510e+00, -3.97804693e-01,
        1.13548875e-01, -4.29144992e-04,  4.78729265e-01, -8.78912824e-01,
       -9.38822282e-01, -6.94481593e-01, -1.95552700e+00, -6.95101263e-02,
       -3.73584798e-01,  3.76232127e-01,  8.01081931e-01, -7.53131444e-02,
        1.84643275e+00,  7.93835437e-01, -2.88327622e-01,  6.17624961e-01,
       -1.87808607e-01,  7.69686359e-01,  1.01144356e+00, -6.37061240e-01,
        1.99065578e-01, -1.86266599e-01, -7.60605516e-01, -8.34053887e-01,
        3.77027704e-01,  6.59823055e-01,  7.99716562e-01,  1.26767449e+00,
       -1.95638296e+00, -6.85044208e-01, -6.58524743e-01, -9.46285219e-01,
        8.21466686e-01,  6.73713942e-01, -3.37082956e-01,  1.24910678e+00,
        7.98086260e-01,  9.88442043e-01, -4.55346086e-01, -6.99152497e-01,
        3.02801321e-01,  1.34247881e+00,  4.92470396e-01, -3.75578329e-01,
        1.77256573e+00, -3.65789587e-02, -1.15898095e+00,  1.46948181e+00,
       -1.49363595e+00,  7.88530881e-03,  1.37853382e-01,  8.88894174e-01,
       -9.10663269e-01,  8.85040135e-01, -7.25795872e-02, -1.32540947e+00,
       -3.52814191e-01,  5.43673860e-01,  2.47475529e-01, -3.96367218e-01,
        7.23931628e-01,  1.30153828e-01,  1.90777405e-01, -9.32426624e-01,
       -1.56492668e-01, -1.00756598e+00, -6.90064533e-01, -4.55894294e-01,
       -4.65967506e-01, -5.10414171e-01, -6.97464308e-01,  3.99811416e-01,
       -1.55209308e-01,  6.90323332e-01,  4.23291079e-01,  1.80358218e+00,
       -8.36690249e-01,  3.71101863e-01,  5.46246714e-01, -7.52532444e-01,
        1.39374457e+00,  3.08296721e-01,  8.36728942e-01,  8.11877578e-01,
       -3.22994945e-02,  8.77548914e-01, -4.31640651e-01,  2.10091465e+00,
        3.48140319e-01,  1.63394392e+00, -1.07140660e+00, -2.50269460e-01,
       -1.48893275e+00,  6.34821437e-01, -1.99952659e-01, -4.99591450e-01,
        5.69998186e-01,  5.88560490e-01,  5.76799033e-01, -1.47451910e+00,
        1.15546116e+00, -1.19822560e+00,  1.02835252e+00,  1.89906198e+00,
       -4.33814312e-01, -1.00512665e+00, -1.01699586e+00, -5.97700162e-01,
       -7.09773033e-01, -2.27975659e+00, -3.22252901e-02, -2.19362776e-01,
       -1.38432173e-01, -2.18646572e-01, -3.87818431e-01,  3.18789928e-03,
        2.03416382e-01,  1.23806951e+00, -1.60507789e+00,  1.02924577e-01,
       -1.23138482e+00,  1.13304610e-01, -3.70894498e-01,  8.37904221e-01,
       -1.93269781e+00,  6.19219091e-01, -2.18425064e+00,  8.72927332e-01,
        4.15701533e-02,  8.86383210e-01,  1.06516510e+00, -9.97709231e-01])

In [144]:
cats=pd.qcut(data,4)
#page no 216-217

In [145]:
cats

[(-0.0162, 0.672], (-0.0162, 0.672], (-0.0162, 0.672], (-3.173, -0.684], (-0.0162, 0.672], ..., (0.672, 3.596], (-0.0162, 0.672], (0.672, 3.596], (0.672, 3.596], (-3.173, -0.684]]
Length: 1000
Categories (4, interval[float64]): [(-3.173, -0.684] < (-0.684, -0.0162] < (-0.0162, 0.672] < (0.672, 3.596]]

In [146]:
df=pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -0.368572 -1.943427 -0.248850
1 -1.015986 -0.355805 -0.059008
2  1.040576 -0.173620  0.418417
3 -0.458154  1.050824 -0.949403
4  0.564210  0.874427 -0.980433
5 -0.211623  1.495523  0.448473
6  0.021653  0.603563 -0.665188

In [147]:
df.iloc[:4,1]=NA

In [148]:
df

          0         1         2
0 -0.368572       NaN -0.248850
1 -1.015986       NaN -0.059008
2  1.040576       NaN  0.418417
3 -0.458154       NaN -0.949403
4  0.564210  0.874427 -0.980433
5 -0.211623  1.495523  0.448473
6  0.021653  0.603563 -0.665188

In [149]:
pd.value_counts(cats)

(0.672, 3.596]       250
(-0.0162, 0.672]     250
(-0.684, -0.0162]    250
(-3.173, -0.684]     250
dtype: int64

In [150]:
data=pd.DataFrame(np.random.randn(1000,4))

In [151]:
data

            0         1         2         3
0    1.528305  0.131042 -1.357804 -0.338764
1    0.472472  1.947958  1.754466 -0.006772
2    0.710144  0.672659 -0.790031 -1.684080
3   -0.168048 -0.001003 -1.021289  0.863499
4    1.241703 -1.302903 -0.078057  1.648826
..        ...       ...       ...       ...
995 -1.667825  1.003113 -1.208517 -0.868137
996 -0.265875  0.936375 -0.438893  0.538959
997  1.042859 -0.784914  0.925883 -0.655642
998  2.482751 -1.030498  0.877555 -0.526822
999 -0.610107 -1.268667  0.678029  0.496634

[1000 rows x 4 columns]

In [152]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.037849    -0.011710     0.013252     0.018506
std       0.994492     0.959946     1.037652     1.008959
min      -3.889687    -2.598349    -3.835593    -3.637681
25%      -0.737065    -0.657130    -0.682646    -0.693757
50%      -0.050626    -0.063701     0.037199     0.006278
75%       0.600867     0.585408     0.703056     0.688575
max       3.406262     3.717809     3.365548     3.385758

In [153]:
data[2]

0     -1.357804
1      1.754466
2     -0.790031
3     -1.021289
4     -0.078057
         ...
995   -1.208517
996   -0.438893
997    0.925883
998    0.877555
999    0.678029
Name: 2, Length: 1000, dtype: float64

In [154]:
col=data[2]

In [155]:
col[np.abs(col)>3]

180    3.365548
205   -3.835593
859   -3.750958
Name: 2, dtype: float64

In [159]:
data[np.abs(data)>3]

      0   1   2   3
0   NaN NaN NaN NaN
1   NaN NaN NaN NaN
2   NaN NaN NaN NaN
3   NaN NaN NaN NaN
4   NaN NaN NaN NaN
..   ..  ..  ..  ..
995 NaN NaN NaN NaN
996 NaN NaN NaN NaN
997 NaN NaN NaN NaN
998 NaN NaN NaN NaN
999 NaN NaN NaN NaN

[1000 rows x 4 columns]

In [160]:
data[np.abs(data>3).any(1)]
#select all rows having a value exceeding 3 or -3

            0         1         2         3
180  1.058698  0.622904  3.365548  0.320628
284 -0.278664  0.130509  1.491161  3.385758
315  0.253402  3.224868  0.372328 -1.000705
665  0.431223  3.407761  0.762551  0.704928
757  2.347599  3.717809  0.850339 -0.744876
904  3.406262 -0.347976 -0.787069 -1.456319

In [166]:
np.sign(data)*3
#The sign function returns -1 if x < 0, 0 if x==0, 1 if x > 0

       0    1    2    3
0    3.0  3.0 -3.0 -3.0
1    3.0  3.0  3.0 -3.0
2    3.0  3.0 -3.0 -3.0
3   -3.0 -3.0 -3.0  3.0
4    3.0 -3.0 -3.0  3.0
..   ...  ...  ...  ...
995 -3.0  3.0 -3.0 -3.0
996 -3.0  3.0 -3.0  3.0
997  3.0 -3.0  3.0 -3.0
998  3.0 -3.0  3.0 -3.0
999 -3.0 -3.0  3.0  3.0

[1000 rows x 4 columns]

In [167]:
data[np.abs(data)>3]=np.sign(data)*3

In [168]:
data

            0         1         2         3
0    1.528305  0.131042 -1.357804 -0.338764
1    0.472472  1.947958  1.754466 -0.006772
2    0.710144  0.672659 -0.790031 -1.684080
3   -0.168048 -0.001003 -1.021289  0.863499
4    1.241703 -1.302903 -0.078057  1.648826
..        ...       ...       ...       ...
995 -1.667825  1.003113 -1.208517 -0.868137
996 -0.265875  0.936375 -0.438893  0.538959
997  1.042859 -0.784914  0.925883 -0.655642
998  2.482751 -1.030498  0.877555 -0.526822
999 -0.610107 -1.268667  0.678029  0.496634

[1000 rows x 4 columns]

In [169]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.034979    -0.019061     0.016473     0.020921
std       0.976723     0.942551     1.019549     0.993058
min      -2.771643    -2.598349    -2.915753    -2.848142
25%      -0.737065    -0.657130    -0.682646    -0.693757
50%      -0.050626    -0.063701     0.037199     0.006278
75%       0.600867     0.585408     0.703056     0.688575
max       2.755802     2.574684     2.776683     2.940593

In [170]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1  1.0  1.0  1.0 -1.0
2  1.0  1.0 -1.0 -1.0
3 -1.0 -1.0 -1.0  1.0
4  1.0 -1.0 -1.0  1.0

In [171]:
df=pd.DataFrame(np.arange(5*4).reshape(5,4))

In [172]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [173]:
sampler=np.random.permutation(5)

In [174]:
sampler

array([2, 0, 1, 4, 3])

In [176]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
1   4   5   6   7
4  16  17  18  19
3  12  13  14  15

In [178]:
df.sample(n=3) #random

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
0   0   1   2   3

In [179]:
choices=pd.Series([5,7,-1,6,4])

In [180]:
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [183]:
choices.sample(n=10, replace=True)

2   -1
4    4
0    5
2   -1
1    7
1    7
2   -1
2   -1
1    7
2   -1
dtype: int64

In [184]:
df=pd.DataFrame({'key':['b','b','a','c','a','b'],
                'data1':range(6)})

In [185]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [188]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [9]:
data={'Dave':'dave@google.com','Steve':'steve@gmail.com',
     'Rob':'rob@gmail.com','Wes':np.nan}
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': nan}

In [11]:
data=pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [12]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [14]:
display(data)
data.str.contains('gmail')

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [15]:
import re

In [16]:
text="foo   bar\t baz  \tqux"
text

'foo   bar\t baz  \tqux'

In [20]:
re.split('\s+',text)
#\s+ remove whitespaces between them

['foo', 'bar', 'baz', 'qux']

In [22]:
regex=re.compile('\s+')
regex

re.compile(r'\s+', re.UNICODE)

In [23]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [24]:
regex.findall(text)
#returns all whitespaces which split function removes.

['   ', '\t ', '  \t']

In [26]:
text="""Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Rya ryan@yahoo.com"""
text

'Dave dave@google.com\nSteve steve@gmail.com\nRob rob@gmail.com\nRya ryan@yahoo.com'

In [28]:
pattern=r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [29]:
pattern

'[A-Z0-9._%+-]+@[A-Z0-9.-]+\\.[A-Z]{2,4}'

In [31]:
regex=re.compile(pattern, flags=re.IGNORECASE)
regex

re.compile(r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}', re.IGNORECASE|re.UNICODE)

In [32]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [34]:
m=regex.search(text)
m

In [35]:
text

'Dave dave@google.com\nSteve steve@gmail.com\nRob rob@gmail.com\nRya ryan@yahoo.com'

In [36]:
text[m.start()]

'd'

In [37]:
text[m.end()]

'\n'

In [38]:
text[m.start():m.end()]

'dave@google.com'

In [41]:
print(regex.match(text))

None

In [42]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Rya REDACTED

In [43]:
pattern=r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [47]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [48]:
m=regex.match('arfkhan11@gmail.com')

In [49]:
m

In [50]:
m.groups()

('arfkhan11', 'gmail', 'com')

In [51]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [55]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3',text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Rya Username: ryan, Domain: yahoo, Suffix: com

In [56]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [58]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [61]:
matches=data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object